#+title:Research Report 
#+author:Geng Feiyang
#+DUEDATE:<2016-07-13 Wed>

**** energy profile of phase diagram 
#+BEGIN_SRC python

import numpy as np
from numpy.linalg import inv,norm
from jasp import *
import matplotlib.pyplot as plt
from numpy import array, linspace, polyval
n = ['13-encut500-er35-vib-ref0-0708','13-encut500-er35-novib-ref0']# encut=500
#n = ['13-encut350-er35-500up','35-encut500-er35-550up']
plt.figure()

filename = '../../CuAuMC/phd{0}.out'.format(n[0])

with open(filename) as f:
    lines = f.readlines()

E = []
Temp = []
mu = []
x1 = []
x2 = []
U1= []
U2 = []
CP1 = []
CP2 = []
for line in lines[::]:
     mu += [np.array(line[0:-1].split(), dtype=float)[1]]
     x1 +=  [np.array(line[0:-1].split(), dtype=float)[2]]
     x2 +=  [np.array(line[0:-1].split(), dtype=float)[3]] 
     content = [np.array(line[0:-1].split(), dtype=float)[4:]]
     E += content
     Temp += [np.array(line[0:-1].split(), dtype=float)[0]]
b = np.array(E)
b1 = np.array([line[0] for line in E])
b2 = np.array([line[1] for line in E])
for i in range(len(b)):
     U1 += [b1[i]+mu[i]*x1[i]]
     U2 += [b2[i]+mu[i]*x2[i]]
T = np.array(Temp)
n = len(Temp)
pars1 = np.polyfit(T,U1,n*0.5)
pars2 = np.polyfit(T,U2,n*0.5)
temp = np.linspace(min(T),max(T))
#  dpars1 = np.polyder(pars1)
#  dpars2 = np.polyder(pars2)
E_1 = [polyval(pars1,t) for t in temp]
E_2 = [polyval(pars2,t) for t in temp]
#  Cp_1 = [polyval(dpars1,t) for t in temp]
#  Cp_2 = [polyval(dpars2,t) for t in temp]


plt.plot(T,U2,'o-',label='+vib bcc')
plt.plot(T,U1,'o-',label='+vib fcc')

#
filename1 = '../../CuAuMC/phd{0}.out'.format('13-encut500-er35-novib-ref0')

with open(filename1) as f:
    lines = f.readlines()

E = []
Temp = []
mu = []
x1 = []
x2 = []
U1= []
U2 = []
CP1 = []
CP2 = []
for line in lines[::]:
     mu += [np.array(line[0:-1].split(), dtype=float)[1]]
     x1 +=  [np.array(line[0:-1].split(), dtype=float)[2]]
     x2 +=  [np.array(line[0:-1].split(), dtype=float)[3]] 
     content = [np.array(line[0:-1].split(), dtype=float)[4:]]
     E += content
     Temp += [np.array(line[0:-1].split(), dtype=float)[0]]

b = np.array(E)
b1 = np.array([line[0] for line in E])
b2 = np.array([line[1] for line in E])
for i in range(len(b)):
     U1 += [b1[i]+mu[i]*x1[i]]
     U2 += [b2[i]+mu[i]*x2[i]]
T = np.array(Temp)
n = len(Temp)
pars1 = np.polyfit(T,U1,n*0.5)
pars2 = np.polyfit(T,U2,n*0.5)
temp = np.linspace(min(T),max(T))
#  dpars1 = np.polyder(pars1)
#  dpars2 = np.polyder(pars2)
E_1 = [polyval(pars1,t) for t in temp]
E_2 = [polyval(pars2,t) for t in temp]
#  Cp_1 = [polyval(dpars1,t) for t in temp]
#  Cp_2 = [polyval(dpars2,t) for t in temp]


plt.plot(T,U2,'o-',label='without vib bcc')
plt.plot(T,U1,'o-',label='without vib fcc')

plt.legend()
plt.ylabel('Internal energy (eV/atom/K)')
plt.xlabel('Temperature(K))')
plt.savefig('internalE.png')
plt.show()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python

from ase import Atom, Atoms
import numpy as np
from jasp import *
from ase.visualize import view
from ase.lattice import bulk
import os
import matplotlib.pyplot as plt


filename = '../../CuPd_bcc_encut500_vib2/f_Pd-Pd.dat'
with open(filename) as f:
    lines = f.readlines()
bondL = []
strech = []
bend = [] 
for i,line in enumerate(lines):
   if np.array(line[0:].split(),dtype=float)[0]<=2.8: 
     bondL += [np.array(line[0:].split(), dtype=float)[0]]

     strech += [np.array(line[0:].split(), dtype=float)[1]]
     bend += [np.array(line[0:].split(), dtype=float)[2]]
#bond = np.linspace(min(bondL0),max(bondL0))

z = np.polyfit(bondL,strech,1)
z2=np.polyfit(bondL,bend,1)
print z
print z2
plt.subplot(1,2,1)
plt.plot(bondL,strech,'yo',label='ground state')  
#plt.plot(bond,[fits(i) for i in bond],'y-',label='fitted stiffness')
plt.xlabel('bond length (A)')
plt.ylabel('stiffness of bond ')
plt.legend(loc='best')
plt.subplot(1,2,2)
#plt.plot(bond,[fitb(i) for i in bond],'b-',label='fitted stiffness')
plt.plot(bondL,bend,'yo',label='ground state')
plt.ylim([-1,0.1])
plt.xlabel('bond length (A)')
plt.ylabel('stiffness of bond')
plt.legend(loc='best')
plt.tight_layout()
#plt.savefig('Cu-Pd-add.png')
plt.show()
#+END_SRC

#+RESULTS:
: [-15.759  45.875]
: [ 1.779 -5.104]

